{
  "videos": [
    {
      "title":"Jepsen II: Linearizable Boogaloo",
      "dateAdded": "2015-10-23T21:20:43.511Z",
      "description":"What is ACID anyway, and why is everyone so uptight about it? When can't we have eventual consistency, and what do we sacrifice in exchange for stronger models? I've spent the last year trying to wrap my head around consistency in distributed systems, and testing databases to see how those consistency models play out in practice. In this talk we'll explore linearizability--one of the strongest consistency models for a concurrent system--move from an academic definition to an intuitive understanding, and see the ways in which databases succeed--and fail--to live up to their consistency claims",
      "speakers": ["Kyle Kingsbury"],
      "rating":8,
      "duration":45,
      "videoSource": {
        "link":"https://www.youtube.com/embed/QdkS6ZjeR7Q",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/QdkS6ZjeR7Q/0.jpg"
      }
    },
    {
      "title":"Keynote: One Hacker Way - Erik Meijer",
      "dateAdded": "2015-10-22T21:20:43.511Z",
      "description":"This video was recorded at GOTO Copenhagen 2015.http://gotocon.com/cph-2015/presentat... Join us at a GOTO Conference - www.gotocon.com",
      "speakers": ["Erijk Meijer"],
      "rating":8.7,
      "duration":55,
      "videoSource": {
        "link":"https://www.youtube.com/embed/FvMuPtuvP5w",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/FvMuPtuvP5w/0.jpg"
      }
    },
    {
      "title":"The Bad Idea Terminator",
      "dateAdded": "2015-10-16T21:20:43.511Z",
      "description":"Melissa Perri presents how to destroy bad product ideas before they go to market while achieving the business goals and determining product strategy. She brings practical techniques on defining success and creating effective product experiments to kill bad ideas and give energy to the good ones.",
      "speakers": ["Melissa Perri"],
      "rating":7.46,
      "duration":41,
      "videoSource": {
        "link":"http://www.infoq.com/presentations/product-management-bad-ideas",
        "type":"infoq",
        "preview": "http://cdn.infoq.com/statics_s2_20151015-0307/resource/presentations/product-management-bad-ideas/en/slides/sl1.jpg"
      }
    },
    {
      "title":"1024+ Seconds of JS Wizardry",
      "dateAdded": "2015-07-27T22:20:43.511Z",
      "description":"We spend our days creating large-scale applications byte by byte. But what happens at night when we get rid of bloated libraries and browser dependencies? What will we discover deep under the surface if we dissect the language of the web into its atomic parts? In this talk we will hack tweet-sized games, write code in only six characters and create the self-modifying \"Hello World\" in less than 1024 bytes of JavaScript. All just for fun and without asking \"Why?\". Prepare yourself for 140 slides full of old-school ASCII art and crazy code golfing!",
      "speakers": ["Martin Kleppe"],
      "rating":9.23,
      "duration":31,
      "videoSource": {
        "link":"https://www.youtube.com/embed/RTxtiLp1C8Y",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/RTxtiLp1C8Y/0.jpg"
      }
    },
    {
      "title":"Mesos, the operating system for your cloud",
      "dateAdded": "2015-06-27T16:33:43.511Z",
      "description":"In this talk, we'll learn all about Mesos — what it is, how you can leverage it to simplify your infrastructure and reduce AWS/cloud computing costs, and why you should develop your next application on top of it. This talk will give you the tools you need to understand whether Mesos is the right fit for your infrastructure, and several starting points for learning more about Mesos.",
      "speakers": ["David Greenberg"],
      "rating":7.4,
      "duration":46,
      "videoSource": {
        "link":"https://www.youtube.com/embed/LQxnuPcRl4s",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/LQxnuPcRl4s/0.jpg"
      }
    },
    {
      "title":"Docker for Developers",
      "dateAdded": "2015-06-19T16:33:43.511Z",
      "description":"Thanks to Docker, almost every developer can now easily use containers to build, ship, and run any application, anywhere. How does Docker help with those challenges? What does a \"Dockerized\" development workflow look like? We will talk about the origins and history of Docker, explain its technical foundations, describe a few use-cases, and spend some time explaining how to use it efficiently to achieve fast, reproducible software deployments. Demos will abound.",
      "speakers": ["Jérôme Petazzoni"],
      "rating":7.5,
      "duration":54,
      "videoSource": {
        "link":"https://www.youtube.com/embed/FdkNAjjO5yQ",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/FdkNAjjO5yQ/0.jpg"
      }
    },
    {
      "title":"Spotify Culture Part 1 + 2",
      "dateAdded": "2015-02-24T16:33:43.511Z",
      "description":"An attempt to describe Spotify engineering culture. This is a journey in progress, not a journey completed.",
      "speakers": ["Henrik Kniberg"],
      "rating":7.88,
      "duration":26,
      "comment":"Interesting, much improved agile culture beyond Scrum",
      "videoSource": {
        "link":"https://www.youtube.com/embed/Mpsn3WaI_4k",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/Mpsn3WaI_4k/0.jpg"
      }
    },
    {
      "title":"History of Programming: Part 1",
      "dateAdded": "2015-03-09T16:55:43.511Z",
      "description":"Join Mark on a quick-fire, whistle-stop, shallow-to-the-point-of-vacuous tour through the history of programming and programming languages, from the surprise twist at the beginning, through the Golden Age of LISP, C and Smalltalk, right up to the present day. What was the Greatest Programming Language ever? Which is better: dynamic or static typing? Why is Java? What does the future of programming hold for the brave adventurer? Discover the answers to none of these questions or indeed any others in this utterly pointless but hopefully entertaining talk. Warning: not suitable for children or IT managers.",
      "speakers": ["Mark Rendle"],
      "rating":7.9,
      "duration":42,
      "comment":"",
      "videoSource": {
        "link":"//player.vimeo.com/video/97541186",
        "type":"vimeo"
      }
    },
    {
      "title":"Containerizing the Cloud with Docker on Google Cloud Platform",
      "dateAdded": "2015-02-24T16:33:43.511Z",
      "description":"Have you ever wondered about the core technologies that enable Google to rapidly build reliable distributed systems, while simultaneously increasing data center reliability and efficiency? In 2006, Google developed Linux container technology that enabled world leading fleet utilization, efficiency and scale. More recently, these same core technologies formed the foundation of Docker, the popular, new open source container environment. ",
      "speakers": ["Brendan Burns", "Craig McLuckie"],
      "rating":7.5,
      "duration":52,
      "comment":"New technology, docker management",
      "videoSource": {
        "link":"https://www.youtube.com/embed/tsk0pWf4ipw",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/tsk0pWf4ipw/0.jpg"
      }
    },
    {
      "title":"Javascript the good parts",
      "description":"Douglas Crockford is known as The JavaScript Guy. He’s famous not only for his O’Reilly book JavaScript: The Good Parts but even more so as the visionary behind the JSON data format as well as the JSLint tool.",
      "dateAdded": "2015-02-24T16:33:43.511Z",
      "speakers": ["Douglas Crockford"],
      "rating":7.5,
      "duration":60,
      "comment":"Good story teller",
      "videoSource": {
        "link":"https://www.youtube.com/embed/bo36MrBfTk4",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/bo36MrBfTk4/0.jpg"
      }
    },
    {
      "title":"One way hacker",
      "dateAdded": "2015-02-26T16:33:43.511Z",
      "description":"One Hacker Way, a Rational Alternative to Agile",
      "speakers": ["Erik Meijer"],
      "rating":7.38,
      "duration":46,
      "comment":"No consistent story, good message, extreme ideas, good comparison with army organization",
      "videoSource": {
        "link":"//player.vimeo.com/video/110554082",
        "type":"vimeo"
      }
    },
    {
      "title":"Facebook Release Process",
      "dateAdded": "2015-02-26T16:33:43.511Z",
      "description":"Chuck Rossi unveils some of the tools and processes used by Facebook for pushing new updates every day.",
      "speakers": ["Chuck Rossi"],
      "rating":7.13,
      "duration":54,
      "comment":"Nice tools, good culture for massive changes, advanced gatekeeper, irc bots, boring",
      "videoSource": {
        "link":"http://www.infoq.com/presentations/Facebook-Release-Process",
        "type":"infoq",
        "preview": "http://www.infoq.com/resource/presentations/Facebook-Release-Process/en/slides/sl1.jpg"
      }
    },
    {
      "title":"Introduction to Docker",
      "dateAdded": "2015-02-26T16:33:43.511Z",
      "description":"dotCloud founder and CTO Solomon Hykes recently stopped by Twitter HQ to show us Docker, an open source project designed to easily create lightweight, portable, self-sufficient containers from any application.",
      "speakers": ["Solomon Hykes"],
      "rating":7,
      "duration":47,
      "comment":"Good demo, good intro, end was information sparse",
      "videoSource": {
        "link":"https://www.youtube.com/embed/Q5POuMHxW-0",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/Q5POuMHxW-0/0.jpg"
      }
    },
    {
      "title":"Unleash Your Domain",
      "dateAdded": "2015-03-01T16:33:43.511Z",
      "description":"Our application runs over 10,000 sustained transactions per second with a rich model. The key? Modeling state transitions explicitly. In today's world many systems have non–functional requirements that prevent them from being single database centric. This presentation looks at how Domain Driven Design can fit into such environments including extremely large scale web sites, batch processing, and even using highly scalable backing stores such as CouchDb or HyperTable.",
      "speakers": ["Greg Young"],
      "rating":7.3,
      "duration":55,
      "comment":"Good presentor, interesting approach, different from CRUD. Lacking technical details.",
      "videoSource": {
        "link":"//player.vimeo.com/video/19428577",
        "type":"vimeo"
      }
    },
    {
      "title":"RSA Animate - Drive: The surprising truth about what motivates us",
      "dateAdded": "2015-03-14T16:50:43.511Z",
      "description":"This lively RSA Animate, adapted from Dan Pink's talk at the RSA, illustrates the hidden truths behind what really motivates us at home and in the workplace.",
      "speakers": [""],
      "rating":8.2,
      "duration":11,
      "comment":"Interesting information, great style, short, good graphics, to the point",
      "videoSource": {
        "link":"https://www.youtube.com/embed/u6XAPnuFjJc",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/u6XAPnuFjJc/0.jpg"
      }
    },
    {
      "title":"How to avoid death By PowerPoint: David JP Phillips at TEDxStockholmSalon #2/2014 Think Again",
      "dateAdded": "2015-03-20T10:03:43.511Z",
      "description":"With a seldom seen depth of knowledge and passion for his subject, David Phillips has become the leading Swedish figurehead in the art of making presentations. He is the founder and owner of Sweden's largest resource on the subject: Presentationsteknik.com. He is also author of the ground-breaking book \"How To Avoid Death By PowerPoint\" published in more than 30 countries.",
      "speakers": ["David JP Phillips"],
      "rating":8.5,
      "duration":21,
      "comment":"",
      "videoSource": {
        "link":"https://www.youtube.com/embed/Iwpi1Lm6dFo",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/Iwpi1Lm6dFo/0.jpg"
      }
    },
    {
      "title":"React 2014 : Erik Meijer - What does it mean to be Reactive?",
      "dateAdded": "2015-03-23T14:00:00Z",
      "description":"The inimitable Erik Meijer delivering his opening keynote to React 2014",
      "speakers": ["Erik Meijer"],
      "rating":8.1,
      "duration":46,
      "comment":"A nice talk to have a good understanding of Reactive Programming without buzzwords.",
      "videoSource": {
        "link":"http://www.youtube.com/embed/sTSQlYX5DU0",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/sTSQlYX5DU0/0.jpg"
      }
    },
    {
      "title":"No estimates: how you can predict the release date of your project without estimating.",
      "dateAdded": "2015-04-01T16:05:00Z",
      "description":"Often we hear that estimating a project is a must. \"We can't make decisions without them\" we hear often. In this session I'll present examples of how we can predict a release date of a project without any estimates, only relying on easily available data. I'll show how we can follow progress on a project at all times without having to rely on guesswork, and we will review how large, very large and small projects have already benefited from this in the past. At the end of the session you will be ready to start your own #NoEstimates journey.",
      "speakers": ["Vasco Duarte"],
      "rating":7.0,
      "duration":56,
      "comment":"We believe! Project != backlog, because backlog is not known at start of project. Want to invite the speaker. Good discussion after the talk. We can apply this to our own projects. Still use SP for focus in projects.",
      "videoSource": {
        "link":"http://www.youtube.com/embed/G-zy4i6F0lI",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/G-zy4i6F0lI/0.jpg"
      }
    },
    {
      "title":"Humans Need Not Apply",
      "dateAdded": "2015-04-07T00:25:00Z",
      "description":"Humans Need Not Apply is a 2014 short internet documentary film, directed, produced, written, and edited by C.G.P. Grey. The film focuses on the future of the integration of automation into economics, as well as the worldwide workforce.",
      "speakers": ["C.G.P. Grey"],
      "rating":8.9,
      "duration":15,
      "comment":"Amazing video about the scary future of the human race",
      "videoSource": {
        "link":"http://www.youtube.com/embed/7Pq-S557XQU",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/7Pq-S557XQU/0.jpg"
      }
    },
    {
      "title":"Argument from ignorance - Dr. Neil deGrasse Tyson on UFOs",
      "dateAdded": "2015-04-12T21:25:00Z",
      "description":"Dr. Neil deGrasse Tyson gives his remarks on whether we have been visited by extraterrestrials",
      "speakers": ["Neil deGrasse Tyson"],
      "rating":8.1,
      "duration":11,
      "comment":"Great speaker and clear explanation while argument from ignorance is a great example of a bad argument",
      "videoSource": {
        "link":"http://www.youtube.com/embed/NSJElZwEI8o",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/NSJElZwEI8o/0.jpg"
      }
    },
    {
      "title":"2014 World Champlonship of Public Speaking 1st Place Winner",
      "dateAdded": "2015-04-23T21:25:00Z",
      "description":"DANANJAYA J HETTIARACHCHI. World Champion of Public Speaking 2014",
      "speakers": ["Dananjaya J Hettiarachchi"],
      "rating":7.3,
      "duration":8,
      "comment":"",
      "videoSource": {
        "link":"http://www.youtube.com/embed/bbz2boNSeL0",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/bbz2boNSeL0/0.jpg"
      }
    },
    {
      "title":"Could you imagine a world without bosses?",
      "dateAdded": "2015-04-23T21:25:00Z",
      "description":"From crowd-sourcing future strategies to employees who can say no to any request, Gary Hamel, professor at the London Business School, discusses radical managerial practices that can alter the business landscape. View more of the series at http://phoenix.edu/lectures.",
      "speakers": ["Gary Hamel"],
      "rating":7.9,
      "duration":2,
      "comment":"",
      "videoSource": {
        "link":"http://www.youtube.com/embed/x8SV3oAP5wI",
        "type":"youtube",
        "preview": "http://img.youtube.com/vi/x8SV3oAP5wI/0.jpg"
      }
    }
  ]
}